In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = {'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}
df2 = {'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}

In [3]:
one = pd.DataFrame(df1)
two = pd.DataFrame(df2)

In [4]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [5]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [9]:
pd.concat([one,two],axis=1)#the order counts in the list

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [10]:
pd.concat([one,two],axis=0)#it is not recommended to it that way

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [13]:
#to solve that we can rename columns names :
two.columns = one.columns

In [15]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [17]:
my_dat = pd.concat([one,two],axis=0)

In [18]:
#to fix the index we do that :
my_dat

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [20]:
my_dat.index

Index([0, 1, 2, 3, 0, 1, 2, 3], dtype='int64')

In [24]:
my_dat.index = range(len(my_dat))

In [25]:
my_dat

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [26]:
#MERGE :

In [27]:
#firstly we should choose an on column to merge that should be unique and existing in the two tables :

In [28]:
#______INNER_MERGE_____ : intersection :

In [29]:
#the synthaxe :
# pd.merge(tab1,tab2,how = 'inner' ,on = 'name')

In [35]:
reg = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bob','Charlie','David']})
log = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bob']})

In [36]:
reg

   reg_id     name
0       1   Andrew
1       2      Bob
2       3  Charlie
3       4    David

In [37]:
log

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [38]:
pd.merge(reg,log,'inner','name')

   reg_id    name  log_id
0       1  Andrew       2
1       2     Bob       4

In [39]:
#____LEFT & RIGHT MERGE____ :

In [40]:
#the order of arguments passed count now :

In [42]:
#__LEFT__ : we will take entirely the left table and fill with NaN if there isn't correspondence :

In [43]:
pd.merge(reg,log,'left','name')

   reg_id     name  log_id
0       1   Andrew     2.0
1       2      Bob     4.0
2       3  Charlie     NaN
3       4    David     NaN

### RIGHT_MERGE

In [45]:
pd.merge(reg,log,'right','name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0      Bob       4

In [46]:
#___OUTER_MERGE___ :allows us to include everything existing inthe two table :

In [47]:
pd.merge(reg,log,'outer','name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0      Bob     4.0
2     3.0  Charlie     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [48]:
#join on an index instead of a column :

In [49]:
reg.set_index('name')

         reg_id
name
Andrew        1
Bob           2
Charlie       3
David         4

In [54]:
#pd.merge(reg,log,'outer',left_index=True,right_on='name')

In [55]:
reg = reg.reset_index()

In [56]:
reg

   index  reg_id     name
0      0       1   Andrew
1      1       2      Bob
2      2       3  Charlie
3      3       4    David

In [59]:
reg = reg.drop('index',axis=1)

In [60]:
reg

   reg_id     name
0       1   Andrew
1       2      Bob
2       3  Charlie
3       4    David

In [61]:
reg.columns = ['reg_id','reg_name']

In [64]:
res =pd.merge(reg,log,how='inner',left_on='reg_name',right_on='name')

In [65]:
res

   reg_id reg_name  log_id    name
0       1   Andrew       2  Andrew
1       2      Bob       4     Bob

In [66]:
res.drop('reg_name',axis = 1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4     Bob

In [67]:
log

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [68]:
reg.columns = ['id','name']
log.columns = ['id','name']

In [69]:
reg

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4      Bob

In [70]:
log

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4      Bob

In [73]:
pd.merge(reg,log,'inner',left_on='id',right_on='id',suffixes=('_reg','_log'))

   id name_reg name_log
0   1   Andrew   Xavier
1   2      Bob   Andrew
2   3  Charlie  Yolanda
3   4    David      Bob